TDPortal/Utilities/EnhancedExposedServicesTestTool/ExposedServicesTestToolClient/Requests/OpenJourneyPlanner/V1/CoordinateJourney_1.xml

<?xml version="1.0" ?>
<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/">
<S:Header>
<wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
<wsse:UsernameToken><wsse:Username>NHS24</wsse:Username>
<wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">NH5Tw3ntyF0ur#</wsse:Password>
</wsse:UsernameToken>
</wsse:Security>
</S:Header>
<S:Body>
<PlanJourney xmlns="http://www.transportdirect.info/TransportDirect.EnhancedExposedServices.OpenJourneyPlanner.V1">
<transactionId>cc2daec6-96e7-4065-83f6-cfaa7217770d</transactionId>
<language>en-gb</language>
<request><ModeFilter><Include>true</Include>
<Modes><TransportMode><Mode>Walk</Mode></TransportMode><TransportMode><Mode>Bus</Mode></TransportMode>
<TransportMode><Mode>Metro</Mode></TransportMode><TransportMode><Mode>Coach</Mode></TransportMode><TransportMode><Mode>Air</Mode></TransportMode>
</Modes></ModeFilter>
<Depart>true</Depart>
<Destination><Coordinate>
<Easting>363905</Easting>
<Northing>159865</Northing>
</Coordinate><Stops>
<RequestStop><TimeDate>2014-04-27T11:44:23.488+01:00</TimeDate>
</RequestStop>
</Stops>
<Type>Coordinate</Type></Destination>
<Origin>
<Coordinate><Easting>365491</Easting>
<Northing>158651</Northing>
</Coordinate><Stops><RequestStop>
<TimeDate>2014-04-27T11:44:23.488+01:00</TimeDate>
</RequestStop></Stops>
<Type>Coordinate</Type>
</Origin><PublicParameters>
<Algorithm>Default</Algorithm>
<InterchangeSpeed>10</InterchangeSpeed>
<IntermediateStops>All</IntermediateStops>
<MaxWalkDistance>30</MaxWalkDistance>
<RangeType>Sequence</RangeType>
<TrunkPlan>false</TrunkPlan>
<WalkSpeed>20</WalkSpeed>
</PublicParameters>
</request>
</PlanJourney>
</S:Body>
</S:Envelope>